Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/variants/omnitrak_controller_v2_2/variant.h
#define PIN_V_IN_ADC        PIN_A0        // 24V power supply voltage monitor.
#define PIN_I_IN_ADC        PIN_A1        // 24V power supply current monitor.
#define PIN_9V_UVLO         PIN_A2        // Under-voltage lock-out level on the 9V power supply.
#define PIN_9V_ADC          PIN_A3        // 9V power supply voltage monitor.
#define PIN_5V_ADC          PIN_A4        // 9V power supply voltage monitor.

#define PIN_P1_IOUT         PIN_A5        // OTMP Port 1 current monitor.
#define PIN_P2_IOUT         PIN_A6        // OTMP Port 2 current monitor.
#define PIN_P3_IOUT         PIN_A7        // OTMP Port 3 current monitor.
#define PIN_P4_IOUT         PIN_A8        // OTMP Port 4 current monitor.
#define PIN_P5_IOUT         PIN_A9        // OTMP Port 5 current monitor.

#define PIN_BNC_OUT_1       PIN_DAC0      // BNC digital-to-analog output #1.
#define PIN_BNC_OUT_2       PIN_DAC1      // BNC digital-to-analog output #2.
#define PIN_BNC_IN_1        PIN_A12       // BNC analog-to-digital input #1.
#define PIN_BNC_IN_2        PIN_A13       // BNC analog-to-digital input #2.

#define PIN_BOARD_ID        PIN_A14       // Board ID analog reference.


/*
 * Digital pins
 */

// Vulintus Peripheral Bus (VPB)
#define PIN_VPB_CLK_IN      (14u)         // PB02 - CLK_IN_3V3   (14)
#define PIN_VPB_CLK_OUT     (15u)         // PB01 - CLK_OUT_3V3  (15)
#define PIN_VPB_TRG         (16u)         // PB00 - TRG_3V3      (16)
#define PIN_VPB_BLOCK       (17u)         // PB03 - nVPB_BLOCK   (17)

// NINA W102 Module
#define PIN_NINA_RST        (18u)         // PC10 - nNINA_RST    (18)
#define PIN_NINA_CS         (19u)         // PA06 - nNINA_CS     (19)
#define PIN_NINA_DEBUG      (20u)         // PA01 - nNINA_DEBUG  (20)
#define PIN_NINA_ACK        (21u)         // PA07 - nNINA_ACK    (21)
#define PIN_NINA_BOOT       (22u)         // PC07 - nNINA_BOOT   (22)
#define NINA_GPIO0          PIN_NINA_BOOT
#define NINA_RESETN         PIN_NINA_RST
#define NINA_ACK            PIN_NINA_ACK

// TFT Display
#define PIN_TFT_RST         (28u)         // PC13 - nTFT_RST     (28)
#define PIN_TFT_LED         (29u)         // PC11 - TFT_LED      (29)
#define PIN_TFT_DC          (30u)         // PB13 - TFT_DC       (30)
#define PIN_TFT_CS          (31u)         // PC14 - nTFT_CS      (31)
#define TFT_RST             PIN_TFT_RST
#define TFT_LED             PIN_TFT_LED
#define TFT_DC              PIN_TFT_DC
#define TFT_CS              PIN_TFT_CS
#define TFT_WIDTH           160
#define TFT_HEIGHT          128
#define TFT_ROTATION        1

// RV-3208-C7 Real-Time Clock
#define PIN_RTC_INT         (35u)         // PC15 - nRTC_INT     (35)
#define PIN_RTC_EVI         (36u)         // PA14 - nRTC_EVI     (36)
#define PIN_RTC_CLKO        (37u)         // PA00 - RTC_CLKO     (37)

// User Input
#define PIN_QT_RST          (38u)         // PB12 - nQT_RST      (38)
#define PIN_QT_INT          (39u)         // PA04 - nQT_INT      (39)

// Piezo Speaker
#define PIN_SPKR            (44u)         // PB14 - SPKR         (44)

// Power Control
#define PIN_PWR_SHDN        (50u)         // PB17 - nPWR_SHDN    (50)
#define PIN_I_IN_RESET      (51u)         // PB16 - I_IN_REST    (51)
#define PIN_PWR_FAULT       (52u)         // PD21 - nPWR_FAULT   (52)
#define PIN_9V_ON_FLAG      (53u)         // PD20 - n9V_ON_FLAG  (53)

// OTMP Power Control
#define PIN_P1_24V_EN       (64u)         // PB19
#define PIN_P2_24V_EN       (65u)         // PB21
#define PIN_P3_24V_EN       (66u)         // PA21
#define PIN_P4_24V_EN       (67u)         // PB29
#define PIN_P5_24V_EN       (68u)         // PA27
#define PIN_P1_ALERT        (74u)         // PB26
#define PIN_P2_ALERT        (75u)         // PB27
#define PIN_P3_ALERT        (76u)         // PB28
#define PIN_P4_ALERT        (77u)         // PC24
#define PIN_P5_ALERT        (78u)         // PC25
#define PIN_P1_RST          (79u)         // PB20
#define PIN_P2_RST          (80u)         // PA20
#define PIN_P3_RST          (81u)         // PB23
#define PIN_P4_RST          (82u)         // PC26
#define PIN_P5_RST          (83u)         // PC03

// BNC I/O
#define PIN_BNC_SW_1        (88u)         // PC18
#define PIN_BNC_SW_2        (89u)         // PC19
#define PIN_BNC_EN_1        (90u)         // PC20
#define PIN_BNC_EN_2        (91u)         // PC21

// Fan Control
#define PIN_FAN             (92u)         // PA19


/*
 * Serial interfaces
 */

// Serial1, OTMP Port 1 (SERCOM0)
#define PIN_SERIAL1_TX      (54ul)        // PC17
#define PIN_SERIAL1_RX      (55ul)        // PC16
#define PAD_SERIAL1_TX      (UART_TX_PAD_0)
#define PAD_SERIAL1_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL1		  sercom0

// Serial2, OTMP Port 2 (SERCOM3)
#define PIN_SERIAL2_TX      (56ul)        // PC23
#define PIN_SERIAL2_RX      (57ul)        // PC22
#define PAD_SERIAL2_TX      (UART_TX_PAD_0)
#define PAD_SERIAL2_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL2		  sercom3

// Serial3, OTMP Port 3 (SERCOM5)
#define PIN_SERIAL3_TX      (58ul)        // PA23
#define PIN_SERIAL3_RX      (59ul)        // PA22
#define PAD_SERIAL3_TX      (UART_TX_PAD_0)
#define PAD_SERIAL3_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL3		  sercom5

// Serial4, OTMP Port 4 (SERCOM2)
#define PIN_SERIAL4_TX      (60ul)        // PB25
#define PIN_SERIAL4_RX      (61ul)        // PB24
#define PAD_SERIAL4_TX      (UART_TX_PAD_0)
#define PAD_SERIAL4_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL4		  sercom2

// Serial5, OTMP Port 5 (SERCOM7)
#define PIN_SERIAL5_TX      (62ul)        // PC12
#define PIN_SERIAL5_RX      (63ul)        // PB31
#define PAD_SERIAL5_TX      (UART_TX_PAD_0)
#define PAD_SERIAL5_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL5		  sercom7

// Serial6, NINA Programming Serial (SERCOM6)
#define PIN_SERIAL6_TX      (23ul)        // PC04
#define PIN_SERIAL6_RX      (24ul)        // PC05
#define PAD_SERIAL6_TX      (UART_TX_PAD_0)
#define PAD_SERIAL6_RX      (SERCOM_RX_PAD_1)
#define SERCOM_SERIAL6		  sercom6


/*
 * SPI Interfaces
 */
#define SPI_INTERFACES_COUNT 1

#define PIN_SPI_MOSI        (0u)         // PC27 (S1.0)
#define PIN_SPI_MISO        (1u)         // PB22 (S1.2)
#define PIN_SPI_SCK         (2u)         // PC28 (S1.1)
#define PERIPH_SPI          sercom1
#define PAD_SPI_TX          SPI_PAD_0_SCK_1       // PICO/MOSI on PAD 0, SCK on PAD1
#define PAD_SPI_RX          SERCOM_RX_PAD_2       // POCI/MISO on PAD 2

