Vulintus/Vulintus_Board_Definitions/hardware/samd/0.2.0/variants/omnitrak_controller_v2_2/variant.h
static const uint8_t MOSI = PIN_SPI_MOSI;
static const uint8_t MISO = PIN_SPI_MISO;
static const uint8_t SCK  = PIN_SPI_SCK;

#define PIN_SPI_PICO        PIN_SPI_MOSI
#define PIN_SPI_POCI        PIN_SPI_MISO
static const uint8_t PICO = PIN_SPI_PICO;
static const uint8_t POCI = PIN_SPI_POCI;

#define SPIWIFI_SS          PIN_NINA_CS
#define SPIWIFI_ACK         PIN_NINA_ACK
#define SPIWIFI_RESET       PIN_NINA_RST

// Needed for SD library
#define PIN_SPI1_MISO       (9u)          // PA09 - SD_DAT0, S0.1/SA2.0
#define PIN_SPI1_MOSI       (7u)          // PA08 - SD_CMD,  S0.0/SA2.1
#define PIN_SPI1_SCK        (8u)          // PB11 - SD_CLK,  SA4.3
#define PIN_SPI1_SS         (12u)         // PB10 - SD_DAT3, SA4.2

// #define PERIPH_SPI1   sercom2             
#define PAD_SPI1_TX   SPI_PAD_0_SCK_3   
#define PAD_SPI1_RX   SERCOM_RX_PAD_1     
static const uint8_t SS1   = PIN_SPI1_SS;   
static const uint8_t MOSI1 = PIN_SPI1_MOSI; 
static const uint8_t MISO1 = PIN_SPI1_MISO;   
static const uint8_t SCK1  = PIN_SPI1_SCK;    

#define SDCARD_SPI          SPI1
#define SDCARD_MISO_PIN     PIN_SPI1_MISO
#define SDCARD_MOSI_PIN     PIN_SPI1_MOSI
#define SDCARD_SCK_PIN      PIN_SPI1_SCK
#define SDCARD_SS_PIN       PIN_SPI1_SS


/*
 * Wire Interfaces
 */
#define WIRE_INTERFACES_COUNT 1

// I2C bus.
#define PIN_WIRE_SDA        (3u)          // PA13
#define PIN_WIRE_SCL        (4u)          // PA12
#define PERIPH_WIRE         sercom4
#define WIRE_IT_HANDLER     SERCOM4_Handler
// #define WIRE_IT_HANDLER_0   SERCOM4_0_Handler
// #define WIRE_IT_HANDLER_1   SERCOM4_1_Handler
// #define WIRE_IT_HANDLER_2   SERCOM4_2_Handler
// #define WIRE_IT_HANDLER_3   SERCOM4_3_Handler

static const uint8_t SDA = PIN_WIRE_SDA;
static const uint8_t SCL = PIN_WIRE_SCL;


/*
 * USB
 */
#define PIN_USB_DM          (96ul)        // PA24
#define PIN_USB_DP          (97ul)        // PA25
#define PIN_USB_HOST_ENABLE (94ul)        // PA15 - SAMBA    (94)
#define PIN_USB_DETECT      (95ul)        // PC06
#define USB_DETECT          PIN_USB_DETECT


/*
 * I2S Interfaces
 */
#define I2S_INTERFACES_COUNT 0


/*
 * SDHC Interfaces (SDHC0)
*/
#define PIN_SD_DETECT       (5u)          // PD12 - SD card detection
#define PIN_SD_WP           (6u)          // PD11 - SD card write protection
#define PIN_SD_CMD          (7u)          // PA08 - Command line for SDHC operation.
#define PIN_SD_CLK          (8u)          // PB11 - Clock line for SDHC operation.
#define PIN_SD_DAT0         (9u)          // PA09 - Data 0 line for SDHC operation.
#define PIN_SD_DAT1         (10u)         // PA10 - Data 1 line for SDHC operation.
#define PIN_SD_DAT2         (11u)         // PA11 - Data 2 line for SDHC operation.
#define PIN_SD_DAT3         (12u)         // PB10 - Data 3 line for SDHC operation.
#define PIN_SDHC_EN         (13u)         // PD08 - Switch CMD/CLK/DAT0 between SDHC and SPI.
#define SD_CMD              PIN_SD_CMD
#define SD_CLK              PIN_SD_CLK
#define SD_DAT0             PIN_SD_DAT0
#define SD_DAT1             PIN_SD_DAT1
#define SD_DAT2             PIN_SD_DAT2
#define SD_DAT3             PIN_SD_DAT3
#define SDHC_EN             PIN_SDHC_EN


/*
 * Other pins?? 
 */
#define PIN_ATN             (99u)       // PA03 - I don't think we need this definition....
static const uint8_t ATN = PIN_ATN;


/*----------------------------------------------------------------------------
 *        Arduino objects - C++ only
 *----------------------------------------------------------------------------*/

#ifdef __cplusplus

#include "SERCOM.h"
#include "Uart.h"

/*	=========================
*	===== SERCOM DEFINITION
*	=========================
*/
extern SERCOM sercom0;    // OTMP Port 1
extern SERCOM sercom1;    // SPI, SerialHCI
extern SERCOM sercom2;    // OTMP Port 4
extern SERCOM sercom3;    // OTMP Port 2
extern SERCOM sercom4;    // I2C
extern SERCOM sercom5;    // OTMP Port 3
extern SERCOM sercom6;    // SerialNina
extern SERCOM sercom7;    // OTMP Port 5

// OTMP serial ports.
extern Uart Serial1;
extern Uart Serial2;
extern Uart Serial3;
extern Uart Serial4;
extern Uart Serial5;

// NINA programming serial port.
extern Uart Serial6;

// SerialHCI - Required for NINA operation, no idea what it does.
extern Uart SerialHCI;                            // Create the option of a serial on the main SPI bus (SERCOM1)
#define PIN_SERIALHCI_RX    PIN_SPI_POCI          // SPI POCI
#define PIN_SERIALHCI_TX    PIN_SPI_PICO          // SPI PICO
#define PAD_SERIALHCI_TX    (UART_TX_PAD_0)       // SPI PICO is on SERCOM1.0
#define PAD_SERIALHCI_RX    (SERCOM_RX_PAD_2)     // SPI POCI is on SERCOM1.2
#define PIN_SERIALHCI_RTS   PIN_NINA_CS           // NINA chip-select
#define PIN_SERIALHCI_CTS   PIN_SPI_SCK           // SPI SCK

#endif // __cplusplus

// These serial port names are intended to allow libraries and architecture-neutral
// sketches to automatically default to the correct port name for a particular type
// of use.  For example, a GPS module would normally connect to SERIAL_PORT_HARDWARE_OPEN,
// the first hardware serial port whose RX/TX pins are not dedicated to another use.
// 
// SERIAL_PORT_MONITOR        Port which normally prints to the Arduino Serial Monitor
// 
// SERIAL_PORT_USBVIRTUAL     Port which is USB virtual serial
// 
// SERIAL_PORT_LINUXBRIDGE    Port which connects to a Linux system via Bridge library
// 
// SERIAL_PORT_HARDWARE       Hardware serial port, physical RX & TX pins.
// 
// SERIAL_PORT_HARDWARE_OPEN  Hardware serial ports which are open for use.  Their RX & TX
//                           pins are NOT connected to anything by default.
#define SERIAL_PORT_USBVIRTUAL      Serial
#define SERIAL_PORT_MONITOR         Serial

// Serial has no physical pins broken out, so it's not listed as HARDWARE port
#define SERIAL_PORT_HARDWARE        Serial6
#define SERIAL_PORT_HARDWARE_OPEN   Serial6

// Alias Serial1 to SerialNina (useful in libraries)
#define SerialNina                  Serial6
#define SPIWIFI                     SPI

// Alias Serial to SerialUSB
#define SerialUSB                   Serial

#endif /* _VARIANT_OMNITRAK_CONTROLLER_V2_2_ */